/*****************************************

* 文件名称          zf_driver_timer
* 文件作用          通用定时器驱动（定时器启停、计数模式、脉冲/时间测量）

****************************************/

#ifndef _zf_driver_timer_h_
#define _zf_driver_timer_h_

#include "ti_msp_dl_config.h"

#include "zf_common_typedef.h"

typedef enum
{
    TIM_A0,
    TIM_A1,
    TIM_G0,
    TIM_G6,
    TIM_G7,
    TIM_G8,
    TIM_G12,
} timer_index_enum;

typedef enum
{
    TIMER_SYSTEM_CLOCK, // 系统频率计时 最大 0xFFFF
    TIMER_US,           // 微秒计时 最大 0xFFFF
    TIMER_MS,           // 毫秒计时 最大 0xFFFF/2
} timer_mode_enum;

typedef enum
{
    TIMER_FUNCTION_INIT = 0, // 功能未初始化
    TIMER_FUNCTION_TIMER,    // 用作 TIMER 计时
    TIMER_FUNCTION_PIT,      // 用作 PIT
    TIMER_FUNCTION_PWM,      // 用作 PWM
} timer_function_enum;

#define TIM_NUM (7)

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 外设确认功能状态 库内部调用
// 参数说明     index           TIMER 外设模块号
// 参数说明     mode            需要确的功能模块
// 返回参数     uint8           1-可以使用 0-不可以使用
// 使用示例     zf_assert(timer_funciton_check(index, mode);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
uint8 timer_funciton_check(timer_index_enum index, timer_function_enum mode);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 时钟使能 库内部调用
// 参数说明     index           TIMER 外设模块号
// 返回参数     void
// 使用示例     timer_clock_enable(index);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void timer_clock_enable(timer_index_enum index);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 开始计时
// 参数说明     index           TIMER 外设模块号
// 返回参数     void
// 使用示例     timer_start(index);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void timer_start(timer_index_enum index);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 停止计时
// 参数说明     index           TIMER 外设模块号
// 返回参数     void
// 使用示例     timer_stop(index);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void timer_stop(timer_index_enum index);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 获取计时器计数
// 参数说明     index           TIMER 外设模块号
// 返回参数     uint16          计数值
// 使用示例     timer_get(index);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
uint16 timer_get(timer_index_enum index);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 清除计时器计数
// 参数说明     index           TIMER 外设模块号
// 返回参数     void
// 使用示例     timer_clear(index);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void timer_clear(timer_index_enum index);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     TIMER 计时器初始化
// 参数说明     index           TIMER 外设模块号
// 参数说明     mode            计时方式
// 返回参数     void
// 使用示例     timer_init(index, mode);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void timer_init(timer_index_enum index, timer_mode_enum mode);

#endif
